// Найдите середину отрезка, заданного координатами своих концов. 
var
  x1, x2, y1, y2, t1, t2 : real;
  begin
    readln(x1, x2, y1, y2);
    t1 := (x1 + y1)/2;
    t2 := (x2 +y2)/2;
    writeln('Координаты середины = ', t1, ' ', t2);
  end.