// Найдите следующее четное число за заданным. 
var
   s, n : integer;
    begin
    writeln('Введите число');
    readln(n);
    s := (n div 2) * 2 + 2;
    writeln(s);
    end.